package al.dmitriy.dev.learning.apptexts

// Тексты сообщений
const val textForAdminSnd = "Сообщение для всех пользователей. Введите текст сообщения, затем отправьте его"
const val textForAdminTtl = "Сообщение заглавия уроков. Введите текст сообщения, затем отправьте его"
const val textForAdminTop = "Замена изображения верхнего банера. Введите текст url адреса, затем отправьте его"
const val textForAdminBot = "Замена изображения нижнего банера. Введите текст url адреса, затем отправьте его"

const val textForDelUserdata = "❗ Будут удалены все данные пользователя. Хотите продолжить?"
const val textForCategory = "\uD83D\uDD39 Категория:   "
const val textForCategoryEnd = "   ㅤㅤㅤㅤЗдесь вы можете:ㅤㅤㅤㅤ  ㅤㅤㅤㅤ  ㅤㅤㅤㅤㅤㅤ"
const val textForButtonMenu = " ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ\n\uD83D\uDD39 "
const val textForOn = "\uD835\uDC0E\uD835\uDC0D"
const val textForOff = "\uD835\uDC0E\uD835\uDC05\uD835\uDC05"
const val textForIncorrectAnswer = " ㅤㅤㅤㅤㅤㅤㅤ❌  Не верно ㅤㅤㅤㅤㅤㅤㅤ\nПравильно:\n\uD83D\uDD39 "
const val textForProperlyAnswer = "ㅤㅤㅤ✅  Отлично, всё правильно!ㅤㅤㅤ\n\n\uD83D\uDD39 "
const val textForDeleted = "ㅤㅤㅤㅤㅤㅤㅤ✅ Удаленоㅤㅤㅤㅤㅤㅤㅤ"
const val textForIsDel = "\n\nㅤㅤㅤㅤㅤㅤУдалить?ㅤㅤㅤㅤㅤㅤ"
const val textForYours = "ㅤㅤㅤㅤㅤСписок ваших текстов: ㅤㅤㅤㅤㅤㅤㅤ\n\n\uD83D\uDD39 "
const val textForUnwatch = "ㅤㅤㅤНет текстов для просмотраㅤㅤㅤㅤㅤ"
const val textForDel = "ㅤㅤВыберите текст для удаления:ㅤㅤㅤㅤㅤㅤㅤㅤㅤ"
const val textForEmpty = "ㅤㅤㅤㅤНет текстов для удаленияㅤㅤㅤㅤㅤㅤㅤ"
const val textForLimit = "ㅤㅤㅤㅤ❌  Достигнут лимит текстов в категорииㅤㅤㅤㅤㅤ"
const val textForSuccessInput = "ㅤㅤㅤㅤ✅  Текст был добавленㅤㅤㅤㅤㅤㅤ"
const val textForSuccessAnswer = "ㅤㅤㅤㅤㅤㅤ✅  Правильно!ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ"
const val textForWrongAnswer = " ㅤㅤㅤㅤㅤㅤㅤ❌  Не верно ㅤㅤㅤㅤㅤㅤㅤ\nПравильно:\n\uD83D\uDD39 "
const val textForWrongAnswerSec = "\n\nВаш вариант: \n\uD83D\uDD38 "
const val textForSuccessAdd = "ㅤ✅  Имя пользователя было добавленоㅤㅤㅤㅤㅤㅤㅤㅤ"
const val textForWrongInput = " ㅤㅤㅤㅤㅤㅤ Ошибка ввода ㅤㅤㅤㅤㅤㅤㅤㅤ"
const val textForUnregisterUser = "Пользователь не зарегистрирован"
const val textForNameInput = "Введите ваше имя в поле ввода и отправьте сообщение"
const val textForErrUser = "Ошибка. Имя пользователя уже задано, или пользователь не зарегистрирован"
const val textForGreet = "ㅤㅤㅤㅤㅤㅤㅤ\uD835\uDC0B\uD835\uDC04\uD835\uDC12\uD835\uDC12\uD835\uDC0E\uD835\uDC0D\uD835\uDC12ㅤㅤㅤㅤㅤㅤㅤㅤ"
const val textForIncorrectInput = "ㅤㅤ❌  Текст введён не корректноㅤㅤㅤㅤㅤㅤㅤ"
const val textForRuInput = "\uD83D\uDD30 Теперь введите перевод на русском языке, затем отправьте сообщение в чат"
const val textForAddWords = "\uD83D\uDD30  Чтобы начать тренировку, сначала необходимо добавить слова для изучения. Добавить или удалить слова и тексты вы можете с помощью соответствующих кнопок меню. " +
        "Длинна добавляемого слова/текста не может быть более 15 символов (букв)."
const val textForEnInput = "\uD83D\uDD30  Для добавления собственных предложений, необходимо сначала ввести в поле ввода и отправить текст на английском языке, затем его перевод на русском языке.\n" +
        "Введите текст на английском языке, затем отправьте сообщение."
const val textForOwn = "В этом разделе вы можете добавить или удалить собственные тексты для выбранной категории.\nОграничения для добавления:\n\uD83D\uDD39 Для текста - он должен содержать " +
        "не более 70 знаков (букв) и не более 10 отдельных слов, для категории <Учить новые слова> не более 15 знаков. Текст не должен содержать спецсимволов\n\uD83D\uDD39 Для каждой категории" +
        " действует ограничение - не более 100 добавленных текстов\nВыберите категорию:"
const val textForOthers = "В этом разделе вы можете воспользоваться текстами уроков других пользователей (при их наличии).\n\n☝  Будьте внимательны при использовании материалов из данного раздела, так как " +
        "правильность текстов других пользователей не проверяется и не может быть гарантирована.\nВыберите категорию:"
const val textForSettings = "ㅤㅤㅤㅤㅤㅤМеню настроекㅤㅤㅤㅤㅤㅤ\n\n\uD83D\uDD39 Показывать таблицы и подсказки - включить/отключить сообщения с изображениями таблиц, подсказок и сопроводительной информацией." +
        "\n\n\uD83D\uDD39 Только свои тексты уроков - при включенной опции для тренировок будут доступны только собственные тексты, тексты приложения не будут включены в урок (доступно только при наличии добавленных текстов)." +
        "\n\n\uD83D\uDD39 Сообщения с тренировками - пока опция включена, пользователю будут приходить сообщения с предложением потренировать слова добавленные для изучения. Если " +
        "слов на изучении нет, сообщения приходить не будут. Время рассылки сообщений можно настроить самостоятельно: используя клавиши ⏪ и ⏩ устанавливается час (Мск.) с " +
        "которого сообщения могут прийти и час, после которого сообщения приходить не будут (по умолчанию с 12 до 20 часов). Интервал времени рассылки определяется случайным образом."
const val textForHelp = "Краткий мануал по использованию English Learning - бот программы, предназначенной для тренировок и изучения базовых конструкций в Английском языке. \n\uD83D\uDD39Уроки разделены на категории," +
        " каждая из которых содержит набор предложений и речевых оборотов и кроме того, доступна для добавления собственных текстов пользователя. В процессе тренировки пользователю необходимо составить текст " +
        "из предлагаемого набора слов, расположив их в правильном порядке. Также существует возможность изучать новые слова, для этого в соответствующей категории доступен особый вид тренировки, когда " +
        "пользователь в случайном порядке выбирает из списка/вводит изучаемое слово, либо его перевод. Тексты добавленные одними пользователями могут быть доступны для тренировок любому другому пользователю." +
        " \nОбратите внимание, что по умолчанию с 12 часов по 20 часов (Московское время) включена рассылка сообщений с предложением тренировки слов, находящихся на изучении (если они добавлены). Интервал времени рассылки " +
        "произвольный (1-2 сообщения в течение времени, установленного по дефолту). Часы рассылки можно изменить, либо совсем отключить рассылку.\nПриятного использования \uD83D\uDE0A\n\nСвязаться с разработчиком: \n\n\uD83D\uDDE8    " +
        "https://t.me/alimov_dmitrii\n\n\uD83D\uDCE7    al.dmitriy.dev@gmail.com"



